espressif/esp-idf/components/soc/esp32c61/include/soc/spi_mem_c_struct.h
typedef struct {
    volatile spi_mem_c_cmd_reg_t mem_cmd;
    uint32_t reserved_004;
    volatile spi_mem_c_ctrl_reg_t mem_ctrl;
    volatile spi_mem_c_ctrl1_reg_t mem_ctrl1;
    volatile spi_mem_c_ctrl2_reg_t mem_ctrl2;
    volatile spi_mem_c_clock_reg_t mem_clock;
    volatile spi_mem_c_user_reg_t mem_user;
    volatile spi_mem_c_user1_reg_t mem_user1;
    volatile spi_mem_c_user2_reg_t mem_user2;
    uint32_t reserved_024[2];
    volatile spi_mem_c_rd_status_reg_t mem_rd_status;
    uint32_t reserved_030;
    volatile spi_mem_c_misc_reg_t mem_misc;
    uint32_t reserved_038;
    volatile spi_mem_c_cache_fctrl_reg_t mem_cache_fctrl;
    volatile spi_mem_c_cache_sctrl_reg_t mem_cache_sctrl;
    volatile spi_mem_c_sram_cmd_reg_t mem_sram_cmd;
    volatile spi_mem_c_sram_drd_cmd_reg_t mem_sram_drd_cmd;
    volatile spi_mem_c_sram_dwr_cmd_reg_t mem_sram_dwr_cmd;
    volatile spi_mem_c_sram_clk_reg_t mem_sram_clk;
    volatile spi_mem_c_fsm_reg_t mem_fsm;
    uint32_t reserved_058[26];
    volatile spi_mem_c_int_ena_reg_t mem_int_ena;
    volatile spi_mem_c_int_clr_reg_t mem_int_clr;
    volatile spi_mem_c_int_raw_reg_t mem_int_raw;
    volatile spi_mem_c_int_st_reg_t mem_int_st;
    uint32_t reserved_0d0;
    volatile spi_mem_c_ddr_reg_t mem_ddr;
    volatile spi_smem_c_ddr_reg_t smem_ddr;
    uint32_t reserved_0dc[9];
    volatile spi_fmem_pmsn_attr_reg_t fmem_pmsn_attr[4];
    volatile spi_fmem_pmsn_addr_reg_t fmem_pmsn_addr[4];
    volatile spi_fmem_pmsn_size_reg_t fmem_pmsn_size[4];
    volatile spi_smem_c_pmsn_attr_reg_t smem_pmsn_attr[4];
    volatile spi_smem_c_pmsn_addr_reg_t smem_pmsn_addr[4];
    volatile spi_smem_c_pmsn_size_reg_t smem_pmsn_size[4];
    uint32_t reserved_160;
    volatile spi_mem_c_pms_reject_reg_t mem_pms_reject;
    volatile spi_mem_c_ecc_ctrl_reg_t mem_ecc_ctrl;
    volatile spi_mem_c_ecc_err_addr_reg_t mem_ecc_err_addr;
    volatile spi_mem_c_axi_err_addr_reg_t mem_axi_err_addr;
    volatile spi_smem_c_ecc_ctrl_reg_t smem_ecc_ctrl;
    volatile spi_smem_c_axi_addr_ctrl_reg_t smem_axi_addr_ctrl;
    volatile spi_mem_c_axi_err_resp_en_reg_t mem_axi_err_resp_en;
    volatile spi_mem_c_timing_cali_reg_t mem_timing_cali;
    volatile spi_mem_c_din_mode_reg_t mem_din_mode;
    volatile spi_mem_c_din_num_reg_t mem_din_num;
    volatile spi_mem_c_dout_mode_reg_t mem_dout_mode;
    volatile spi_smem_c_timing_cali_reg_t smem_timing_cali;
    volatile spi_smem_c_din_mode_reg_t smem_din_mode;
    volatile spi_smem_c_din_num_reg_t smem_din_num;
    volatile spi_smem_c_dout_mode_reg_t smem_dout_mode;
    volatile spi_smem_c_ac_reg_t smem_ac;
    uint32_t reserved_1a4[23];
    volatile spi_mem_c_clock_gate_reg_t mem_clock_gate;
    uint32_t reserved_204[63];
    volatile spi_mem_c_xts_plain_base_reg_t mem_xts_plain_base;
    uint32_t reserved_304[15];
    volatile spi_mem_c_xts_linesize_reg_t mem_xts_linesize;
    volatile spi_mem_c_xts_destination_reg_t mem_xts_destination;
    volatile spi_mem_c_xts_physical_address_reg_t mem_xts_physical_address;
    volatile spi_mem_c_xts_trigger_reg_t mem_xts_trigger;
    volatile spi_mem_c_xts_release_reg_t mem_xts_release;
    volatile spi_mem_c_xts_destroy_reg_t mem_xts_destroy;
    volatile spi_mem_c_xts_state_reg_t mem_xts_state;
    volatile spi_mem_c_xts_date_reg_t mem_xts_date;
    uint32_t reserved_360[7];
    volatile spi_mem_c_mmu_item_content_reg_t mem_mmu_item_content;
    volatile spi_mem_c_mmu_item_index_reg_t mem_mmu_item_index;
    volatile spi_mem_c_mmu_power_ctrl_reg_t mem_mmu_power_ctrl;
    volatile spi_mem_c_dpa_ctrl_reg_t mem_dpa_ctrl;
    uint32_t reserved_38c[25];
    volatile spi_mem_c_registerrnd_eco_high_reg_t mem_registerrnd_eco_high;
    volatile spi_mem_c_registerrnd_eco_low_reg_t mem_registerrnd_eco_low;
    uint32_t reserved_3f8;
    volatile spi_mem_c_date_reg_t mem_date;
} spi_mem_c_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(spi_mem_c_dev_t) == 0x400, "Invalid size of spi_mem_c_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
